src_doc/InformationRegisters/СвязиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СвязиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СвязанныйОбъектОтправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСвязей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязанныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязаннаяСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйОбъектСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыОбращений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/СвязиОбъектов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру полей связи
//
// Возвращаемое значение:
//   Структура
//     Документ
//     СвязанныйДокумент
//     ТипСвязи
//     Комментарий
//
Функция ПолучитьСтруктуруСвязи() Экспорт
	
	СтруктураСвязи = Новый Структура;
	СтруктураСвязи.Вставить("Объект");
	СтруктураСвязи.Вставить("СвязанныйОбъект");
	СтруктураСвязи.Вставить("ТипСвязи");
	СтруктураСвязи.Вставить("Комментарий");
	
	Возврат СтруктураСвязи;
	
КонецФункции

// Создает и записывает в БД связь
//
// Параметры:
//   СтруктураСвязи - Структура - структура полей связи.
//
Процедура СоздатьСвязь(СтруктураСвязи) Экспорт
	
	СвязиОбъектов.СоздатьСвязь(
		СтруктураСвязи.Объект,
		СтруктураСвязи.СвязанныйОбъект,
		СтруктураСвязи.ТипСвязи);
	
КонецПроцедуры

// Конструктор параметров обновления данных кэширующих объектов.
//
// Возвращаемое значение:
//	Структура:
//	 * ДокументыДляОбновления - Массив из СправочникСсылка.ДокументыПредприятия
//
Функция ПараметрыОбновленияДанныхКэширующихОбъектов() Экспорт
	
	ПараметрыОбновления = Новый Структура;
	ПараметрыОбновления.Вставить("ДокументыДляОбновления", Новый Массив);
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Устанавливает значения параметров обновления данных кэширующих объектов по данным объекта.
//
// Параметры:
//  НаборЗаписей - РегистрСведенийНаборЗаписей.СвязиОбъектов
//
// Возвращаемое значение:
//	См. РегистрыСведений.СвязиОбъектов.ПараметрыОбновленияДанныхКэширующихОбъектов
//
Функция ЗначенияПараметровОбновленияДанныхКэширующихОбъектов(НаборЗаписей) Экспорт
	
	ПараметрыОбновления = ПараметрыОбновленияДанныхКэширующихОбъектов();
	
	ПредыдущиеЗаписи = ОбщегоНазначенияДокументооборот.ПредыдущиеЗаписи(НаборЗаписей);
	ТекущиеЗаписи = НаборЗаписей.Выгрузить();
	
	// Влияет на Документы.МоиДокументы.ДанныеМоегоДокумента().
	УдаленныеИДобавленныеЗаписи =
		ОбщегоНазначенияДокументооборот.УдаленныеИДобавленныеЗаписи(НаборЗаписей, ТекущиеЗаписи, ПредыдущиеЗаписи);
	Для Каждого Запись Из УдаленныеИДобавленныеЗаписи Цикл
		
		Если ТипЗнч(Запись.Объект) <> Тип("СправочникСсылка.ДокументыПредприятия")
			Или Запись.ТипСвязи <> Справочники.ТипыСвязей.ПолученОтвет Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыОбновления.ДокументыДляОбновления.Найти(Запись.Объект) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОбновления.ДокументыДляОбновления.Добавить(Запись.Объект);
		
	КонецЦикла;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Обновляет данные зависимых объектов согласно установленным параметрам.
//
// Параметры:
//  НаборЗаписей - РегистрСведенийНаборЗаписей.СвязиОбъектов
//  ПараметрыОбновления - См. РегистрыСведений.СвязиОбъектов.ПараметрыОбновленияДанныхКэширующихОбъектов
//
Процедура ОбновитьДанныеКэширующихОбъектов(НаборЗаписей, ПараметрыОбновления) Экспорт
	
	Для Каждого ДокументДляОбновления Из ПараметрыОбновления.ДокументыДляОбновления Цикл
		ВлияющийОбъектМетаданных = Метаданные.РегистрыСведений.СвязиОбъектов.ПолноеИмя();
		ЗависимыйОбъектМетаданных = Метаданные.Документы.ДанныеМоегоДокумента.ПолноеИмя();
		РегистрыСведений.ОчередьОбновленияКэширующихДанных.Добавить(
			ЗависимыйОбъектМетаданных,
			ВлияющийОбъектМетаданных,
			ДокументДляОбновления);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
